app/controllers/users_controller.rb

SELECT "users".* FROM "users"  ORDER BY date desc
---
	def index
		@users = User.all.order("date desc")

INSERT INTO "users" ("f_name", "l_name", "e_mail", "commitment", "org", "date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["f_name", "frank"], ["l_name", "tweed"], ["e_mail", "ft@gmail.com"], ["commitment", "live"], ["org", "UN"], ["date", "2016-04-04 15:30:46.990204"]]
UPDATE "users" SET "date" = $1 WHERE "users"."id" = $2  [["date", "2016-04-04 17:08:34.150125"], ["id", 12]]
INSERT INTO "social_handles" ("twitter", "facebook", "instagram", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["twitter", "@tweed"], ["facebook", "ftweed"], ["instagram", "ftweed"], ["user_id", 1]]
---
	def create
		@user = User.create user_params
		binding.pry
		@user.date = DateTime.now
		@user.save
		if @user.save
			@user.social_handles.create social_params