app/controllers/welcome_controller.rb

SELECT "users".* FROM "users"
---
	def root
		@users = User.all